### Q2.

In [81]:
import pandas as pd

In [82]:
df = pd.read_csv('Assignment1_Q2_Data(1).csv')

In [83]:
df.head()

   recid  mm  dd  yy      firstname  surname sex  age seek_surname  seek_first
0  38575   4  25  68  Martin Joesph    Glynn   m  NaN        Glynn  Daniel C.
1  34452  12  23  65         Eugene   Dunlay   m  NaN      Collins        John
2  34453  12  23  65        Maurice   Dunlay   m  NaN      Collins        John
3  34454  12  23  65           John   Dunlay   m  NaN      Collins        John
4  35259   5  26  66        William  Milwood   m  NaN      Milwood       Henry

### 2.1)Write a python code to compute the number of unique last names of people listed in the dataset.

In [84]:
#Removing rows where surname is empty or null
df_surname_cleaned = df[df.surname!=' ']
len(df_surname_cleaned[df.surname == ' '])

0

In [85]:
#Number of unique last names of people listed in the dataset
df_surname_cleaned.surname.nunique()

8271

### 2.2)Write a python code to compute the most common last names of people listed in the dataset.

In [86]:
df_common_names = df.groupby(['surname']).size().sort_values(ascending=False).reset_index()
df_common_names.rename(columns={0:'count'},inplace=True)
df_common_names.head(15)

       surname  count
0     sullivan    572
1       murphy    529
2         ryan    383
3        kelly    378
4        walsh    305
5      o'brien    267
6     McCarthy    241
7   fitzgerald    201
8        lynch    184
9        moran    170
10     collins    162
11    Sullivan    160
12    McNamara    146
13     McGrath    144
14       barry    141

### 2.3)Write a python code to compute the youngest person in the dataset.

In [87]:
df.age.unique()

array([nan, '25', '56', '50', '36', '22', '33', '30', '26', '24', '61',
       '23', '45', '40', '21', '32', '44', '46', '27', '34', '60', '28',
       '37', '29', '16', '20', '35', '31', '17', '70', '19', '48', '18',
       '38', '15', '54', '55', '41', '14', '12', '42', '13', '7', '11',
       '8', '2', '9', '10', '66', '6', '49', '3', '43', '53', '4', '>7',
       '1', '80', '57', '5', '59', '62', '58', '47', '51', '65', '52',
       '39', '2?', '68', '69', '64', '72', '74'], dtype=object)

In [88]:
#Handling unusual data
df_age_cleaned = df[(df.age!='>7') & (df.age!='2?')].copy()

In [89]:
#Converting string to a numeric value
df_age_cleaned['age'] = pd.to_numeric(df_age_cleaned['age'])

In [90]:
#Young people in the dataset
df_age_cleaned[df_age_cleaned.age == df_age_cleaned.age.min()]

       recid  mm  dd  yy firstname surname sex  age seek_surname seek_first
12968  11538  12   3  53      john   lyons   m  1.0     monaghan      eliza
14644  13276   7   1  54     henry    keer   m  1.0         keer    francis

### 2.4)Write a Python code to the number of entries where the person seeking information has the same surname as the person being sought.

In [91]:
#Filtering data with same surnames
df_same_surname = df[df.seek_surname == df.surname].copy()
len(df_same_surname)

26190